nitrogenVerification/0/thermo:Cp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thermo:Cp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 -1 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
1674.81
1674.85
1674.89
1674.93
1674.97
1675.01
1675.05
1675.09
...
)
;

boundaryField
{
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40002
(
1094.86
1674.81
1674.81
1674.85
1674.89
1674.93
1674.97
1675.01
...
)
;
    }
}


// ************************************************************************* //
