nitrogenVerification/0/thermo:Cv
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      thermo:Cv;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 -1 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
1116.17
1116.07
1115.97
1115.87
1115.77
1115.67
1115.57
1115.47
...
)
;

boundaryField
{
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
40002
(
754.12
1116.17
1116.17
1116.07
1115.97
1115.87
1115.77
1115.67
...
)
;
    }
}


// ************************************************************************* //
