nitrogenVerification/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoReactingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1e-6;

deltaT          1e-6;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        functionObjectLibs ( "libfieldFunctionObjects.so" );
        enabled         true;
        outputControl   outputTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type probes;

        // Name of the directory for probe data
        name probes;

        // Write at same frequency as fields
        outputControl outputTime;
        outputInterval 1;

        // Fields to be probed
        fields
        (
	//Big Cp is in J/kg.K
	//Wee cp is in J/kmol.K
            rho T thermo:Cp thermo:Cv thermo:mu thermo:kappa
        );

        // Locations to be probed. runTime modifiable!
        probeLocations
        (
	    (0 0 -0.005)
	    (0 0 -0.0049)
	    (0 0 -0.0048)
	    (0 0 -0.0047)
	    (0 0 -0.0046)
	    (0 0 -0.0045)
	    (0 0 -0.0044)
	    (0 0 -0.0043)
	    (0 0 -0.0042)
	    (0 0 -0.0041)
	    (0 0 -0.004)
	    (0 0 -0.003)
	    (0 0 -0.002)
	    (0 0 -0.001)
	    (0 0 0)
	    (0 0 0.001)
	    (0 0 0.002)
	    (0 0 0.003)
	    (0 0 0.004)
	    (0 0 0.005)
	    (0 0 0.006)
	    (0 0 0.007)
	    (0 0 0.008)
	    (0 0 0.009)
        );  
    }

}

// ************************************************************************* //
